In [1]:
import pandas as pd

### Pandas Apply
We will run through 3 examples:
1. How to iterate through *columns*
2. How to iterate through *rows*
3. Trying out a pandas function with apply

But first, let's create our DataFrame

In [2]:
df = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )
df

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

Then I'm going to create a very quick function that simply prints out what is passed to apply

In [10]:
def print_outcome(x):
    print (type(x))
    print (x)
    print ()

#### Iterating through columns!
When you want to iterate through columns, make sure that you have axis=0, which is also the default

In [13]:
df.apply(print_outcome, axis=0)

<class 'pandas.core.series.Series'>
0    Foreign Cinema
1         Liho Liho
2          500 Club
3        The Square
Name: name, dtype: object

<class 'pandas.core.series.Series'>
0    Restaurant
1    Restaurant
2           bar
3           bar
Name: type, dtype: object

<class 'pandas.core.series.Series'>
0     289
1     224
2    80.5
3    25.3
Name: AvgBill, dtype: object

name       None
type       None
AvgBill    None
dtype: object

Notice that apply went through column by column and printed out a Series. These series contain the values of each row in that column.

#### Iterating through rows!

Let's do the same thing, but iterate through rows (axis=1) instead of columns.

In [14]:
df.apply(print_outcome, axis=1)

<class 'pandas.core.series.Series'>
name       Foreign Cinema
type           Restaurant
AvgBill               289
Name: 0, dtype: object

<class 'pandas.core.series.Series'>
name        Liho Liho
type       Restaurant
AvgBill           224
Name: 1, dtype: object

<class 'pandas.core.series.Series'>
name       500 Club
type            bar
AvgBill        80.5
Name: 2, dtype: object

<class 'pandas.core.series.Series'>
name       The Square
type              bar
AvgBill          25.3
Name: 3, dtype: object

0    None
1    None
2    None
3    None
dtype: object

Same thing, but this time we iterated through the rows and we were returned a series, one value for each column. Notice how the column names ended up being the row index

#### Pandas function with apply

I want to concatenate the series of values in to 1 string, separated by a ",". In order to do this, I'll use a custom function.

In [47]:
def combine_strings(row):
    return "{}, {}, {}".format(row['name'], row['type'], row['AvgBill'])

df.apply(combine_strings, axis=1)

0    Foreign Cinema, Restaurant, 289.0
1         Liho Liho, Restaurant, 224.0
2                  500 Club, bar, 80.5
3                The Square, bar, 25.3
dtype: object

In my custom function above, I had an argument within combine_strings, 'row', which would be a series of values from our dataframe. I then parsed out each column by it's name (name, type, AvgBill) and combined them together using python's format.